{
  "meta": {
    "title": "Products & Partners | Rotomech International – Global Industrial Alliances",
    "description": "Explore Rotomech International’s trusted partners and industrial product portfolio. Discover industry-leading MRO spare parts, pumps, mechanical seals, filtration systems, and more from global manufacturers.",
    "keywords": "Rotomech products, industrial partners, MRO spare parts, pumps, filtration systems, mechanical seals, oil and gas suppliers, global industrial brands, engineering partnerships"
  },
  "banner": {
    "tagline": "Products & Partners",
    "sub": "Where Passion Powers Progress",
    "image": "/images/partners-banner.webp",
    "alt": "products-and-partners-banner"
  },
  "partners": {
    "1": {
      "name": "WTS Energy",
      "logo": "/logos/partnerLogo1.webp",
      "description": "WTS Energy, founded in 2000 and headquartered in The Hague, South Holland, is a leading globally operating staffing and recruitment company focused on the international oil, gas, and renewable energy industries. The company provides professional personnel and outsourcing services, including recruitment campaigns, manpower supply, and workforce management services for projects and operations worldwide. With a presence in over 20 countries across four continents, WTS Energy supports energy companies in their transition to a carbon-neutral society by developing and delivering local talent worldwide.",
      "images": [
        "/images/products/sample.jpg",
        "/images/products/sample.jpg",
        "/images/products/sample.jpg"
      ]
    },
    "2": {
      "name": "BAI Brescia Antincendi International Srl",
      "logo": "/logos/partnerLogo2.webp",
      "description": "BAI Brescia Antincendi International Srl is an Italian company specializing in the design, production, and sale of firefighting and rescue vehicles. Their product range includes civil, airport, industrial firefighting vehicles, water platforms, multi-rescue, and forest firefighting vehicles. BAI also offers customized special vehicles tailored to specific customer requirements, ensuring maximum technology and quality. Additionally, they provide technical assistance, spare parts supply, and training programs for the use and maintenance of their vehicles.",
      "images": [
        "/images/products/sample.jpg",
        "/images/products/sample.jpg"
      ]
    },
    "3": {
      "name": "Nasr Seals Pvt. Ltd.",
      "logo": "/logos/partnerLogo3.webp",
      "description": "Nasr Seals Pvt. Ltd., incorporated on December 11, 2018, is a Mumbai-based manufacturer of mechanical shaft seals, catering to the diversified requirements of process industries. The company offers a wide range of mechanical seals, including Cartridge Seals, Agitator Seals, High Pressure Agitator Seals, Teflon Bellow Seals, Conical Spring Seals, Double Agitator Seals, Rubber Bellow Seals, Metal Bellow Seals, Wave Spring Seals, Reverse Balanced Seals, test rigs for mechanical seals, and more. ",
      "images": [
        "/images/products/nasrsealspvtltd1.webp"
      ]
    },
    "4": {
      "name": "WILLIAMS - An Ingersoll rand Business",
      "logo": "/logos/partnerLogo4.webp",
      "description": "Williams is currently the leading supplier of  eumatically-driven metering pumps for the global oil & gas industry. Our metering pumps and related products have become a standard with most of the world’s oil & gas companies. Williams revolutionized the natural gas distribution industry by developing a method for the positive injection of mercaptans, chemicals for introducing odor into natural gas. Prior to the use of positive injection, the gas industry used the inaccurate bypass method of odorizing natural gas. The  williams’ design approach, which introduced precision, increased safety in an industry that requires a very high level of safety because the public is a customer",
      "images": [
        "/images/products/sample.jpg",
        "/images/products/sample.jpg",
        "/images/products/sample.jpg",
        "/images/products/sample.jpg"
      ]
    },
    "5": {
      "name": "UT Pumps & Systems",
      "logo": "/logos/partnerLogo5.webp",
      "description": "UT Pumps is a leading manufacturer and supplier of innovative pump solutions designed to meet the demands of diverse industrial, water treatment, and oil & gas applications. Renowned for its commitment to quality and efficiency, UT Pumps delivers robust, reliable, and energy-efficient fluid handling systems that help customers optimize their operations. With cutting-edge technology and a focus on sustainability, UT Pumps stands out as a trusted partner in delivering advanced pumping solutions worldwide.",
      "images": [
        "/images/products/sample.jpg",
        "/images/products/sample.jpg",
        "/images/products/sample.jpg"
      ]
    },
    "6": {
      "name": "HETA - Filtration and Separation",
      "logo": "/logos/partnerLogo6.webp",
      "description": "HETA is a globally operating engineering specialist company and anufacturer of filters and separators. Since 2010, HETA has been a member of the PACO group. PACO is a leader in the world market for high-quality metal wire  loths, filters, and sieves. HETA and PACO provide their commitment to the  usiness location in Germany based on conviction and experience.",
      "images": [
        "/images/products/sample.jpg",
        "/images/products/sample.jpg",
        "/images/products/sample.jpg",
        "/images/products/sample.jpg",
        "/images/products/sample.jpg"
      ]
    },
    "7": {
      "name": "test",
      "logo": "/logos/partnerLogo7.webp",
      "description": "test",
      "images": [
        "/images/products/test1.webp",
        "/images/products/test2.webp",
        "/images/products/test4.webp"
      ]
    }
  },
  "procurementPartners": {
    "logo2": "/logos/procurementPartner2.webp",
    "logo3": "/logos/procurementPartner3.webp",
    "logo5": "/logos/procurementPartner5.webp",
    "logo6": "/logos/procurementPartner6.webp",
    "logo7": "/logos/procurementPartner7.webp",
    "logo8": "/logos/procurementPartner8.webp"
  }
}